{
  "architectures": [
    "RWKV07BMoEForCausalLM"
  ],
  "auto_map": {
      "AutoConfig": "configuration_qwen3vlmoetext.RWKV07BMoEConfig",
      "AutoModelForCausalLM": "modeling_qwen3vlmoetext.RWKV07BMoEForCausalLM"
  },
  "description": "Hybrid-RWKV Strategically Interleaved RWKV-Attention",
  "base_model": "Qwen/Qwen3-30B-A3B-Instruct-2507",
  "model_revision": "alpha",

  "image_token_id": 151655,


  "text_config": {
    "transformer_layers":[0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47],
    "rwkv_layers": [-1],
    "rwkv_architecture": "hxa07b",
    "enable_qk_norm": true,
    "nope_in_transformer": true,
    "nope_in_rwkv": false,
    "lora_rank_decay": 256,
    "lora_rank_iclr":128,
    "lora_rank_value_residual_mix":96,
    "lora_rank_key_residual_mix":96,
    "lora_rank_gate":256,
    "attention_bias": false,
    "attention_dropout": 0.0,
    "bos_token_id": 151643,
    "decoder_sparse_step": 1,
    "dtype": "bfloat16",
    "eos_token_id": 151645,
    "head_dim": 128,
    "hidden_act": "silu",
    "hidden_size": 2048,
    "initializer_range": 0.02,
    "intermediate_size": 6144,
    "max_position_embeddings": 262144,
    "mlp_only_layers": [],
    "model_type": "qwen3_vl_moe_text",
    "moe_intermediate_size": 768,
    "norm_topk_prob": true,
    "num_attention_heads": 32,
    "num_experts": 128,
    "num_experts_per_tok": 8,
    "num_hidden_layers": 48,
    "num_key_value_heads": 4,
    "rms_norm_eps": 1e-06,
    "use_rope":true,
    "rope_scaling": {
      "mrope_interleaved": true,
      "mrope_section": [
        24,
        20,
        20
      ],
      "rope_type": "default"
    },
    "rope_theta": 5000000,
    "use_cache": true,
    "vocab_size": 151936
  },
  
  "tie_word_embeddings": false,
  "transformers_version": "4.57.0.dev0",
  "video_token_id": 151656,
  "vision_config": {
    "deepstack_visual_indexes": [
      8,
      16,
      24
    ],
    "depth": 27,
    "hidden_act": "gelu_pytorch_tanh",
    "hidden_size": 1152,
    "in_channels": 3,
    "initializer_range": 0.02,
    "intermediate_size": 4304,
    "model_type": "qwen3_vl_moe",
    "num_heads": 16,
    "num_position_embeddings": 2304,
    "out_hidden_size": 2048,
    "patch_size": 16,
    "spatial_merge_size": 2,
    "temporal_patch_size": 2
  },
  "vision_end_token_id": 151653,
  "vision_start_token_id": 151652
}